; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v3 - type_3)
 	      (pred_2 ?v8 - object ?v3 - type_3)
	      (pred_1 ?v2 - type_1 ?v5 - type_2)
	      (pred_3 ?v2 - type_1 ?v8 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v2 - type_1 ?v7 ?v4 - type_3)
       :precondition (and  (pred_4 ?v2 ?v7))
       :effect (and  (pred_4 ?v2 ?v4)
		     (not (pred_4 ?v2 ?v7))))

   (:action op_2
       :parameters (?v2 - type_1 ?v6 - object ?v1 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v1) (pred_4 ?v2 ?v1) (pred_1 ?v2 ?v5))
       :effect (and (pred_3 ?v2 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v1)) 
		    (not (pred_1 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_1 ?v6 - object ?v1 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v6 ?v5) (pred_4 ?v2 ?v1))
       :effect (and (pred_2 ?v6 ?v1)
		    (pred_1 ?v2 ?v5)
		    (not (pred_3 ?v2 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_02 - type_1
obj_05 obj_03 obj_08 obj_04 - type_2
obj_13 obj_06 obj_09 obj_10 - type_3
obj_11 obj_12 obj_07 - object)
(:init
(pred_4 obj_01 obj_09)
(pred_1 obj_01 obj_05)
(pred_1 obj_01 obj_03)
(pred_4 obj_02 obj_09)
(pred_1 obj_02 obj_08)
(pred_1 obj_02 obj_04)
(pred_2 obj_11 obj_13)
(pred_2 obj_12 obj_10)
(pred_2 obj_07 obj_10)
)
(:goal
(and
(pred_2 obj_11 obj_13)
(pred_2 obj_12 obj_09)
(pred_2 obj_07 obj_09)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_10)))
)
)

; plan
1. (op_3 obj_01 obj_09 obj_13)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_13)
   goals met: 1 of 3
2. (op_3 obj_02 obj_09 obj_10)
   deleted: (pred_4 obj_02 obj_09)
   added: (pred_4 obj_02 obj_10)
   goals met: 1 of 3
3. (op_2 obj_02 obj_07 obj_10 obj_04)
   deleted: (pred_2 obj_07 obj_10) (pred_1 obj_02 obj_04)
   added: (pred_3 obj_02 obj_07 obj_04)
   goals met: 1 of 3
4. (op_2 obj_02 obj_12 obj_10 obj_08)
   deleted: (pred_2 obj_12 obj_10) (pred_1 obj_02 obj_08)
   added: (pred_3 obj_02 obj_12 obj_08)
   goals met: 1 of 3
5. (op_3 obj_02 obj_10 obj_09)
   deleted: (pred_4 obj_02 obj_10)
   added: (pred_4 obj_02 obj_09)
   goals met: 1 of 3
6. (op_1 obj_02 obj_07 obj_09 obj_04)
   deleted: (pred_3 obj_02 obj_07 obj_04)
   added: (pred_2 obj_07 obj_09) (pred_1 obj_02 obj_04)
   goals met: 2 of 3
7. (op_1 obj_02 obj_12 obj_09 obj_08)
   deleted: (pred_3 obj_02 obj_12 obj_08)
   added: (pred_2 obj_12 obj_09) (pred_1 obj_02 obj_08)
   goals met: 3 of 3
